### 16 April, 2022

## Machine Learning Lab- I
### 21BDA33

In [65]:
a=(1,2,3)

In [66]:
a+a

(1, 2, 3, 1, 2, 3)

In [67]:
a=[1,2,3]

In [68]:
a+a

[1, 2, 3, 1, 2, 3]

In [69]:
1+1

2

In [70]:
'1'+'1'

'11'

In [71]:
type(1)

int

In [72]:
type(1.0)

float

In [73]:
type('1')

str

In [74]:
a=12

In [75]:
a==12

True

In [76]:
tup1=(12,20)

In [77]:
type(tup1)

tuple

In [78]:
l1=list(tup1)

In [79]:
type(l1)

list

In [1]:
marks=[10,20,30,50,75,90,95]
for i in range(len(marks)):
    print (marks[i])

10
20
30
50
75
90
95

In [2]:
for mark in marks:
    print(mark)

10
20
30
50
75
90
95

In [3]:
pass_mark=50
for mark in marks:
    print(mark)
    if(mark<pass_mark):
        print("Fail")
    else:
        print("Pass")
    print("--------------")

10
Fail
--------------
20
Fail
--------------
30
Fail
--------------
50
Pass
--------------
75
Pass
--------------
90
Pass
--------------
95
Pass
--------------

### This below program is faulty because the grace condition is wrong

In [4]:
pass_mark=50
for mark in marks:
    print(mark)
    if(mark<pass_mark)&(mark>=50):
        print("Grace")
    elif(mark<30):
        print("Fail")
    else:
        print("Pass")
    print("--------------")

10
Fail
--------------
20
Fail
--------------
30
Pass
--------------
50
Pass
--------------
75
Pass
--------------
90
Pass
--------------
95
Pass
--------------

In [5]:
#pass_mark=50
for mark in marks:
    print(mark)
    if(mark<pass_mark)&(mark>=30):
        print("Grace")
    elif(mark<pass_mark)&(mark<30):
        print("Fail")
    else:
        print("Pass")
    print("--------------")

10
Fail
--------------
20
Fail
--------------
30
Grace
--------------
50
Pass
--------------
75
Pass
--------------
90
Pass
--------------
95
Pass
--------------

### The below program doesnot gives grace because the condition isn't satisfied anywhere

In [6]:
#pass_mark=50
for mark in marks:
    print(mark)
    if(mark<pass_mark)&(mark>30):
        print("Grace")
    elif(mark<pass_mark)&(mark<50):
        print("Fail")
    else:
        print("Pass")
    print("--------------")

10
Fail
--------------
20
Fail
--------------
30
Fail
--------------
50
Pass
--------------
75
Pass
--------------
90
Pass
--------------
95
Pass
--------------

In [7]:
x=range(3,30,3)
for n in x:
    print(n)

3
6
9
12
15
18
21
24
27

In [8]:
def foo_sum(a,b):
    return a+b

In [9]:
foo_sum(4,2)

6

In [10]:
def foo_dif(num1=0,num2=0):
    return num1-num2

In [11]:
foo_dif(num1=15,num2=6)

9

In [12]:
foo_dif(num2=6,num1=15)

9

In [13]:
foo_dif(6,15)

-9

In [14]:
foo_dif(15)

15

In [15]:
num1

NameError: name 'num1' is not defined

#### Scope of num1 is only in the foo_sum and foo_dif function because it is only defined in it

## Python for DS

### Pandas, Numpy, Scipy, Sklearn, Matplotlib
### Anything structured is taken care of by pandas.
### Numpy is numeric Python
### Scipy is Scientific Python
### Sklearn
### Matplotlib

### Structured and Unstructured data.

In [16]:
import pandas as pd
import numpy as np

### There are two types of data Structures in Pandas (initially 3, but now 2) :
### DataFrame and Series
### Series has 2 parts: index and values

In [17]:
marks_series=pd.Series(marks)

In [18]:
marks_series

0    10
1    20
2    30
3    50
4    75
5    90
6    95
dtype: int64

In [19]:
marks_series.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
marks_series.values

array([10, 20, 30, 50, 75, 90, 95])

In [21]:
marks_series[1:] #accessing all the elements from 1st index

1    20
2    30
3    50
4    75
5    90
6    95
dtype: int64

In [22]:
marks_series[:3] #accessing the first 3 elements

0    10
1    20
2    30
dtype: int64

In [23]:
marks_series[5]

90

In [24]:
marks_series.value_counts()

10    1
20    1
30    1
50    1
75    1
90    1
95    1
dtype: int64

In [25]:
sample_df=pd.DataFrame([marks,marks])

In [26]:
sample_df

    0   1   2   3   4   5   6
0  10  20  30  50  75  90  95
1  10  20  30  50  75  90  95

In [27]:
sample_df=sample_df.T # to do transpose of the matrix

In [28]:
sample_df

    0   1
0  10  10
1  20  20
2  30  30
3  50  50
4  75  75
5  90  90
6  95  95

In [29]:
sample_df.columns=['marks01','marks02'] # to change column names

In [30]:
sample_df

   marks01  marks02
0       10       10
1       20       20
2       30       30
3       50       50
4       75       75
5       90       90
6       95       95

In [31]:
df=pd.read_csv("/Users/shivanshi/Downloads/q3.csv")  # to read a csv file

In [32]:
df.head()  # access the first 5 records

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
3,ASN00024002,1963,2,22.93,-34.2833,140.6000,65.5,BERRI_IRRIGATION,AS,Australia
4,ASN00028007,2001,11,NaN,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia

In [33]:
df.tail()  # access the last 5 records

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99996,RSM00032287,1991,11,-2.81,57.0800,156.7000,3.0,UST_HAIRYUZOVO,RS,Russia
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina
99998,CA006137361,1958,10,10.02,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada
99999,CA006137361,1966,1,-7.85,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada

In [35]:
df['country']  # to access a particular column from a df

0        United States
1                Chile
2        United States
3            Australia
4            Australia
             ...
99995           Mexico
99996           Russia
99997        Argentina
99998           Canada
99999           Canada
Name: country, Length: 100000, dtype: object

### This is a series because

In [36]:
df.shape

(100000, 10)

In [37]:
df.isna

<bound method DataFrame.isna of         locationid  year  month   temp  latitude  longitude  stnelev  \
0      USS0010K01S  2000      4   5.27   39.9000  -110.7500   2773.7
1      CI000085406  1940      5  18.04  -18.3500   -70.3330     58.0
2      USC00036376  2013     12   6.22   34.3703   -91.1242     61.0
3      ASN00024002  1963      2  22.93  -34.2833   140.6000     65.5
4      ASN00028007  2001     11    NaN  -14.7803   143.5036     79.4
...            ...   ...    ...    ...       ...        ...      ...
99995  MXXLT347415  1991      4  29.02   17.7800   -96.3100     65.0
99996  RSM00032287  1991     11  -2.81   57.0800   156.7000      3.0
99997  ARM00087166  1937      4  19.42  -27.4460   -58.7620     61.9
99998  CA006137361  1958     10  10.02   42.7833   -81.1667    236.0
99999  CA006137361  1966      1  -7.85   42.7833   -81.1667    236.0

                    station countryid        country
0             INDIAN_CANYON        US  United States
1                     ARICA        CI          Chile
2             SAINT_CHARLES        US  United States
3          BERRI_IRRIGATION        AS      Australia
4                  MUSGRAVE        AS      Australia
...                     ...       ...            ...
99995  VALLE_NACIONAL_VALLE        MX         Mexico
99996        UST_HAIRYUZOVO        RS         Russia
99997            CORRIENTES        AR      Argentina
99998             ST_THOMAS        CA         Canada
99999             ST_THOMAS        CA         Canada

[100000 rows x 10 columns]>

In [38]:
df.isna()

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,True,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
99995,False,False,False,False,False,False,False,False,False,False
99996,False,False,False,False,False,False,False,False,False,False
99997,False,False,False,False,False,False,False,False,False,False
99998,False,False,False,False,False,False,False,False,False,False
99999,False,False,False,False,False,False,False,False,False,False

In [39]:
df.isna().sum()

locationid        0
year              0
month             0
temp          14446
latitude          0
longitude         0
stnelev           0
station           0
countryid         0
country           5
dtype: int64

In [40]:
type(df)

pandas.core.frame.DataFrame

In [42]:
type(df['temp'])

pandas.core.series.Series

In [43]:
type(df['country'])

pandas.core.series.Series

In [45]:
df.fillna(np.NaN)

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
3,ASN00024002,1963,2,22.93,-34.2833,140.6000,65.5,BERRI_IRRIGATION,AS,Australia
4,ASN00028007,2001,11,NaN,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia
...,...,...,...,...,...,...,...,...,...,...
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99996,RSM00032287,1991,11,-2.81,57.0800,156.7000,3.0,UST_HAIRYUZOVO,RS,Russia
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina
99998,CA006137361,1958,10,10.02,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada
99999,CA006137361,1966,1,-7.85,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada

### The difference between the below two is, first one is a list of columns, while the second one is just columnnames and it does not works because the system doesnot understands the second format

In [47]:
df[['countryid','country']]

      countryid        country
0            US  United States
1            CI          Chile
2            US  United States
3            AS      Australia
4            AS      Australia
...         ...            ...
99995        MX         Mexico
99996        RS         Russia
99997        AR      Argentina
99998        CA         Canada
99999        CA         Canada

[100000 rows x 2 columns]

In [48]:
df['countryid','country'] #error statement

KeyError: ('countryid', 'country')

## Dictionaries/syntax-{key1:value1,key2:value2} / dict()

In [49]:
list('ABCDEFG') # converts a string to list (Exclusive to Python)

['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [50]:
s=list('ABCDEFG')

In [63]:
sample_dict = {'Sno':s, 'marks':marks}

In [64]:
sample_dict

{'Sno': ['A', 'B', 'C', 'D', 'E', 'F', 'G'],
 'marks': [10, 20, 30, 50, 75, 90, 95]}

In [54]:
df['month']>3

0         True
1         True
2         True
3        False
4         True
         ...
99995     True
99996     True
99997     True
99998     True
99999    False
Name: month, Length: 100000, dtype: bool

In [56]:
df[df['month']>3] # only true rows are picked up

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
4,ASN00028007,2001,11,NaN,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia
5,USW00024151,1991,4,5.59,42.1492,-112.2872,1362.5,MALAD_CITY,US,United States
...,...,...,...,...,...,...,...,...,...,...
99994,ETXLT861343,1971,7,15.39,8.9800,38.8000,2324.0,ADDIS_ABABA,ET,Ethiopia
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99996,RSM00032287,1991,11,-2.81,57.0800,156.7000,3.0,UST_HAIRYUZOVO,RS,Russia
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina
99998,CA006137361,1958,10,10.02,42.7833,-81.1667,236.0,ST_THOMAS,CA,Canada

In [59]:
df[(df['month']>3)&(df['month']<6)]

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
5,USW00024151,1991,4,5.59,42.1492,-112.2872,1362.5,MALAD_CITY,US,United States
21,USC00465621,1915,4,11.69,39.5500,-80.3500,299.0,MANNINGTON_1_N,US,United States
22,FIE00145947,2007,4,0.73,65.9325,26.5164,154.0,RANUA_KK,FI,Finland
...,...,...,...,...,...,...,...,...,...,...
99974,MXXLT223734,1989,5,NaN,23.2100,-110.0300,80.0,SAN_JACINTOTODOS_SAN,MX,Mexico
99979,ASN00066062,2015,5,16.56,-33.8607,151.2050,39.0,SYDNEY_OBSERVATORY_HILL,AS,Australia
99990,RP000098429,1995,4,29.64,14.5170,121.0000,15.0,NINOY_AQUINO_INTERN,RP,Philippines
99995,MXXLT347415,1991,4,29.02,17.7800,-96.3100,65.0,VALLE_NACIONAL_VALLE,MX,Mexico
99997,ARM00087166,1937,4,19.42,-27.4460,-58.7620,61.9,CORRIENTES,AR,Argentina

In [ ]:
Correlation is the degree of linear relationship
linear relationship when you can write one term in terms of others
when one can be expressed as a function of the other

In [ ]:
when corr is 1 or -1, perfectly correlated

In [60]:
df.corr() #for correlation

               year     month      temp  latitude  longitude   stnelev
year       1.000000 -0.000873  0.010263 -0.030330   0.017549  0.016371
month     -0.000873  1.000000  0.152352  0.003395   0.004964 -0.002225
temp       0.010263  0.152352  1.000000 -0.397717   0.071065 -0.060881
latitude  -0.030330  0.003395 -0.397717  1.000000  -0.338208 -0.050871
longitude  0.017549  0.004964  0.071065 -0.338208   1.000000 -0.092062
stnelev    0.016371 -0.002225 -0.060881 -0.050871  -0.092062  1.000000

In [ ]:
#numpy-log,corr

In [61]:
df.describe()

,year,month,temp,latitude,longitude,stnelev
count,100000.000000,100000.000000,85554.000000,100000.000000,100000.000000,100000.000000
mean,1969.458030,6.494640,10.920770,35.075456,-38.123732,565.562545
std,35.836832,3.446463,11.522444,23.545646,84.297049,1073.647214
min,1720.000000,1.000000,-70.700000,-90.000000,-179.983000,-350.000000
25%,1949.000000,3.000000,3.460000,33.190675,-101.657925,64.000000
50%,1975.000000,6.000000,12.220000,40.793050,-79.568300,240.800000
75%,1998.000000,9.000000,19.570000,47.424700,17.533100,644.700000
max,2020.000000,12.000000,39.950000,82.516700,179.750000,9999.000000